/*
Напишите программу, находящую натуральные корни уравнения
2020X +2021Y=78487894
эффективным перебором. В комментариях напишите, почему перебор - эффективный
*/

#include <iostream>

using namespace std;

int gcd(int a, int b)
{
    while (b > 0)
    {   int r;
        r = a % b;
        a = b;
        b = r;
    }
    
    return a;
}
int main()
{   int a, b, x, y;
    
    a = 2021;
    
    b = 2020;
    /*
     Мы нашли частное решение данного диофантова уравнения. Известо , что все решения представлюятся в виде
     x = 1683 + 2021k
     y = 37154 - 2020k
     Их и только их мы и перебираем.
     k должен быть меньше 37154/2020 так как иначе y будет меньше 0.
     k должен быть больше 0 , так как x должен быть больше 0.
     */
    
    x = 1683;
    y = 37154;
    
    for ( int k = 0; k < 37154/2020 ; k++)
    {
        cout << x + 2021*k << " " << y - 2020*k << endl;
        
    }
    return 0;
}
